[Killed] BlockStatement
main/components/Commons/ManageCowsModal.js:14:33
         setNumber(e.target.value);
     };
 
-    const handleSubmit = (e) => {
-      e.preventDefault();
-      if(number < 0){
-        window.alert(`You cannot ${message} a negative number of cows! Please enter a non-negative number.`);
-
-      } else {
-      if (message.includes('buy')) {
-          onBuy(userCommons, number)
-      }
-      else {
-          onSell(userCommons, number)
-      }
-      setNumber(1);
-      onClose(); // Close the modal
-    }
-    };
+    const handleSubmit = (e) => {};
 
     const handleClose = () => {
killedBy: ManageCowsModal calls onBuy with correct arguments when buy button is clicked
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"commonsId": 1, "cowDeaths": 5, "cowHealth": 98, "cowsBought": 5, "cowsSold": 5, "numOfCows": 5, "totalWealth": 1000, "userId": 1, "username": "George Washington"}, 5

Number of calls: 0

<html>
  <head />

[Killed] BlockStatement
main/components/Commons/ManageCowsModal.js:19:14
       if(number < 0){
         window.alert(`You cannot ${message} a negative number of cows! Please enter a non-negative number.`);
 
-      } else {
-      if (message.includes('buy')) {
-          onBuy(userCommons, number)
-      }
-      else {
-          onSell(userCommons, number)
-      }
-      setNumber(1);
-      onClose(); // Close the modal
-    }
+      } else {}
     };
 
killedBy: ManageCowsModal calls onBuy with correct arguments when buy button is clicked
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"commonsId": 1, "cowDeaths": 5, "cowHealth": 98, "cowsBought": 5, "cowsSold": 5, "numOfCows": 5, "totalWealth": 1000, "userId": 1, "username": "George Washington"}, 5

Number of calls: 0

<html>
  <head />

[Killed] ConditionalExpression
main/components/Commons/ManageCowsModal.js:20:11
         window.alert(`You cannot ${message} a negative number of cows! Please enter a non-negative number.`);
 
       } else {
-      if (message.includes('buy')) {
+      if (false) {
           onBuy(userCommons, number)
       }
killedBy: ManageCowsModal calls onBuy with correct arguments when buy button is clicked
statusReason: TypeError: onSell is not a function

[Killed] ConditionalExpression
main/components/Commons/ManageCowsModal.js:20:11
         window.alert(`You cannot ${message} a negative number of cows! Please enter a non-negative number.`);
 
       } else {
-      if (message.includes('buy')) {
+      if (true) {
           onBuy(userCommons, number)
       }
killedBy: ManageCowsModal calls onSell with correct arguments when sell button is clicked
statusReason: TypeError: onBuy is not a function

[Killed] MethodExpression
main/components/Commons/ManageCowsModal.js:65:128
       </Modal.Body>
       <Modal.Footer data-testid={"buy-sell-cow-modal-footer"} style={{borderTop: '0px'}}>
         <Button data-testid={"buy-sell-cow-modal-cancel"} variant="secondary" onClick={handleClose}>Cancel</Button>
-        <Button data-testid={"buy-sell-cow-modal-submit"} variant="primary" onClick={handleSubmit}>{message[0].toUpperCase() + message.slice(1)}</Button>
+        <Button data-testid={"buy-sell-cow-modal-submit"} variant="primary" onClick={handleSubmit}>{message[0].toUpperCase() + message}</Button>
       </Modal.Footer>
     </Modal>
killedBy: ManageCowsModal modal has correct buy capitalization
statusReason: TestingLibraryElementError: Unable to find an element with the text: Buy. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="padding-right: 2048px;"
>
  <div />

[Killed] MethodExpression
main/components/Commons/ManageCowsModal.js:65:101
       </Modal.Body>
       <Modal.Footer data-testid={"buy-sell-cow-modal-footer"} style={{borderTop: '0px'}}>
         <Button data-testid={"buy-sell-cow-modal-cancel"} variant="secondary" onClick={handleClose}>Cancel</Button>
-        <Button data-testid={"buy-sell-cow-modal-submit"} variant="primary" onClick={handleSubmit}>{message[0].toUpperCase() + message.slice(1)}</Button>
+        <Button data-testid={"buy-sell-cow-modal-submit"} variant="primary" onClick={handleSubmit}>{message[0].toLowerCase() + message.slice(1)}</Button>
       </Modal.Footer>
     </Modal>
killedBy: ManageCowsModal modal has correct buy capitalization
statusReason: TestingLibraryElementError: Unable to find an element with the text: Buy. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="padding-right: 2048px;"
>
  <div />
