[Killed] ArrayDeclaration
main/components/Commons/PagedProfitsTable.js:53:9
     }
 
     const columns = 
-        [
-            {
-                Header: "Profit",
-                accessor: "amount",
-                Cell: ({value}) => `$${value.toFixed(2)}`,
-                width: 200,
-            },
-            {
-                Header: "Date",
-                accessor: "timestamp",
-                Cell: ({ value }) => timestampToDate(value),
-                width: 200,
-            },
-            {
-                Header: "Health",
-                accessor: "avgCowHealth",
-                Cell: ({value}) => `${value.toFixed(2) + '%'}`,
-                width: 200,
-            },
-            {
-                Header: "Cows",
-                accessor: "numCows",
-                width: 200,
-            },
-        ];
+        [];
 
 
killedBy: PagedProfitsTable tests renders correct content
statusReason: TestingLibraryElementError: Unable to find an element with the text: Profit. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <p>
      Page: 
      1
    </p>

[Killed] ObjectLiteral
main/components/Commons/PagedProfitsTable.js:60:13
                 Cell: ({value}) => `$${value.toFixed(2)}`,
                 width: 200,
             },
-            {
-                Header: "Date",
-                accessor: "timestamp",
-                Cell: ({ value }) => timestampToDate(value),
-                width: 200,
-            },
+            {},
             {
                 Header: "Health",
killedBy: Profits tests renders properly when profits is not given
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ArrowFunction
main/components/Commons/PagedProfitsTable.js:69:23
             {
                 Header: "Health",
                 accessor: "avgCowHealth",
-                Cell: ({value}) => `${value.toFixed(2) + '%'}`,
+                Cell: () => undefined,
                 width: 200,
             },
killedBy: PagedProfitsTable tests renders correct content
statusReason: Error: Component(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] EqualityOperator
main/components/Commons/PagedProfitsTable.js:96:98
         <>
             <p>Page: {selectedPage + 1}</p>
             <Button data-testid={`${testId}-previous-button`}onClick={previousPageCallback()} disabled={ selectedPage === 0}>Previous</Button>
-            <Button data-testid={`${testId}-next-button`} onClick={nextPageCallback()} disabled={page.totalPages===0 || selectedPage === page.totalPages-1}>Next</Button>
+            <Button data-testid={`${testId}-next-button`} onClick={nextPageCallback()} disabled={page.totalPages !== 0 || selectedPage === page.totalPages-1}>Next</Button>
             <div
                 data-testid="PagedProfitsTable-CSS"
killedBy: PagedProfitsTable tests buttons are disabled where there are zero pages
statusReason: Error: expect(element).toBeDisabled()

Received element is not disabled:
  <button class="btn btn-primary" data-testid="PagedProfitsTable-next-button" type="button" />

[Killed] EqualityOperator
main/components/Commons/PagedProfitsTable.js:96:121
         <>
             <p>Page: {selectedPage + 1}</p>
             <Button data-testid={`${testId}-previous-button`}onClick={previousPageCallback()} disabled={ selectedPage === 0}>Previous</Button>
-            <Button data-testid={`${testId}-next-button`} onClick={nextPageCallback()} disabled={page.totalPages===0 || selectedPage === page.totalPages-1}>Next</Button>
+            <Button data-testid={`${testId}-next-button`} onClick={nextPageCallback()} disabled={page.totalPages===0 || selectedPage !== page.totalPages - 1}>Next</Button>
             <div
                 data-testid="PagedProfitsTable-CSS"
killedBy: PagedProfitsTable tests renders correct content
statusReason: Error: expect(element).toBeDisabled()

Received element is not disabled:
  <button class="btn btn-primary" data-testid="PagedProfitsTable-next-button" type="button" />

[Killed] StringLiteral
main/components/Commons/PagedProfitsTable.js:101:31
                 data-testid="PagedProfitsTable-CSS"
                 style={{
                     display:"flex",
-                    overflow: 'auto',
+                    overflow: "",
                 }}
             >
killedBy: PagedProfitsTable tests renders correct content
statusReason: Error: expect(element).toHaveStyle()

- Expected

  display: flex;
- overflow: auto;
