[Killed] ArrowFunction
src/main/components/OurTable.js:41:35
     return (<div {...getTableProps()}>
         <Table style={tableStyle} {...getTableProps()} striped bordered hover >
             <thead>
-                {headerGroups.map(headerGroup => (
-                    <tr {...headerGroup.getHeaderGroupProps()}>
-                        {headerGroup.headers.map(column => (
-                            <th
-                                {...column.getHeaderProps({
-                                    ...column.getSortByToggleProps(), // Include sorting functionality
-                                })}
-                                data-testid={`${testid}-header-${column.id}`}
-                            >
-                                {column.render('Header')}
-                                <span data-testid={`${testid}-header-${column.id}-sort-carets`}>
-                                    {column.isSorted
-                                        ? column.isSortedDesc
-                                            ? ' 🔽'
-                                            : ' 🔼'
-                                        : ''}
-                                </span>
-                            </th>
-                        ))}
-                    </tr>
-                ))}
+                {headerGroups.map(() => undefined)}
             </thead>
             <tbody {...getTableBodyProps()}>
killedBy: PagedProfitsTable tests renders correct content
statusReason: TestingLibraryElementError: Unable to find an element with the text: Profit. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <p>
      Page: 
      1
    </p>

[Killed] ArrowFunction
src/main/components/OurTable.js:43:50
             <thead>
                 {headerGroups.map(headerGroup => (
                     <tr {...headerGroup.getHeaderGroupProps()}>
-                        {headerGroup.headers.map(column => (
-                            <th
-                                {...column.getHeaderProps({
-                                    ...column.getSortByToggleProps(), // Include sorting functionality
-                                })}
-                                data-testid={`${testid}-header-${column.id}`}
-                            >
-                                {column.render('Header')}
-                                <span data-testid={`${testid}-header-${column.id}-sort-carets`}>
-                                    {column.isSorted
-                                        ? column.isSortedDesc
-                                            ? ' 🔽'
-                                            : ' 🔼'
-                                        : ''}
-                                </span>
-                            </th>
-                        ))}
+                        {headerGroup.headers.map(() => undefined)}
                     </tr>
                 ))}
killedBy: PagedJobsTable tests renders correct content
statusReason: TestingLibraryElementError: Unable to find an element with the text: id. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <p>
      Page: 
      1
    </p>

[Killed] BlockStatement
src/main/components/OurTable.js:68:62
                     prepareRow(row)
                     return (
                         <tr {...row.getRowProps()}>
-                            {row.cells.map((cell, _index) => {
-                                return (
-                                    <td
-                                        {...cell.getCellProps({})}
-                                        data-testid={`${testid}-cell-row-${cell.row.index}-col-${cell.column.id}`}
-                                    >
-                                        {cell.render('Cell')}
-                                    </td>
-                                )
-                            })}
+                            {row.cells.map((cell, _index) => {})}
                         </tr>
                     )
killedBy: OurTable tests The button appears in the table
statusReason: Error: Unable to find an element by: [data-testid="testId-cell-row-0-col-Click-button"]

<body>
  <div>
    <div
      role="table"
    >
      <table

[Killed] ConditionalExpression
src/main/components/OurTable.js:90:18
                     data-testid={`${testid}-prev-page-button`}
                     disabled={pageIndex === 0}
                 />
-                {pageIndex > 3 && (<Pagination.Item
+                {true && (<Pagination.Item
                     onClick={() => setPageIndex(0)}
                     data-testid={`${testid}-first-page-button`}
killedBy: OurTable tests renders a table with 100 rows and tests the first page button visibility
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/main/components/OurTable.js:96:18
                 >
                     {1}
                 </Pagination.Item>)}
-                {pageIndex > 4 && (<Pagination.Ellipsis data-testid={`${testid}-left-ellipsis`} />)}
+                {true}
                 {pageIndex === 4 && (<Pagination.Item
                     onClick={() => setPageIndex(pageIndex - 3)}
killedBy: OurTable tests renders a table with 100 rows and tests the last page button
statusReason: Error: Unable to find an element by: [data-testid="testid-left-ellipsis"]

<body>
  <div>
    <div
      role="table"
    >
      <table

[Killed] LogicalOperator
src/main/components/OurTable.js:109:18
                 >
                     {pageIndex - 1}
                 </Pagination.Item>)}
-                {pageIndex > 0 && (<Pagination.Item
-                    onClick={() => setPageIndex(pageIndex - 1)}
-                    data-testid={`${testid}-back-one-page-button`}
-                >
-                    {pageIndex}
-                </Pagination.Item>)}
+                {pageIndex > 0 || <Pagination.Item onClick={() => setPageIndex(pageIndex - 1)} data-testid={`${testid}-back-one-page-button`}>
+                    {pageIndex}
+                </Pagination.Item>}
                 <Pagination.Item
                     data-testid={`${testid}-current-page-button`}
killedBy: OurTable tests renders a table with 100 rows and tests the first page
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false
