[Killed] StringLiteral
main/components/Leaderboard/LeaderboardTable.js:8:19
 export default function LeaderboardTable({ leaderboardUsers }) {
     const USD = new Intl.NumberFormat("en-US", {
         style: "currency",
-        currency: "USD",
+        currency: "",
     });
 
killedBy: LeaderboardTable tests renders without crashing for empty table with user not logged in
statusReason: RangeError: Invalid currency code :

[Killed] StringLiteral
main/components/Leaderboard/LeaderboardTable.js:13:21
 
     const columns = [
         {
-            Header: "Farmer",
+            Header: "",
             accessor: (row, _rowIndex) => {
                 const url = `/admin/play/${row.commonsId}/user/${row.userId}`;
killedBy: LeaderboardPage tests renders without crashing for users
statusReason: Error: A column ID (or string accessor) is required!

[Killed] BlockStatement
main/components/Leaderboard/LeaderboardTable.js:14:43
     const columns = [
         {
             Header: "Farmer",
-            accessor: (row, _rowIndex) => {
-                const url = `/admin/play/${row.commonsId}/user/${row.userId}`;
-                return <Link to={url}>{row.username}</Link>;
-            },
+            accessor: (row, _rowIndex) => {},
         },
         {
killedBy: LeaderboardTable tests Has the expected column headers and content for adminUser
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  one
Received:

[Killed] StringLiteral
main/components/Leaderboard/LeaderboardTable.js:15:29
         {
             Header: "Farmer",
             accessor: (row, _rowIndex) => {
-                const url = `/admin/play/${row.commonsId}/user/${row.userId}`;
+                const url = ``;
                 return <Link to={url}>{row.username}</Link>;
             },
killedBy: LeaderboardTable tests Clicking on link navigates to the correct URL
statusReason: Error: expect(element).toHaveAttribute("href", "/admin/play/1/user/1") // element.getAttribute("href") === "/admin/play/1/user/1"

Expected the element to have attribute:
  href="/admin/play/1/user/1"
Received:
  href="/"

[Killed] ObjectLiteral
main/components/Leaderboard/LeaderboardTable.js:19:9
                 return <Link to={url}>{row.username}</Link>;
             },
         },
-        {
-            Header: "Total Wealth",
-            accessor: "totalWealth",
-            Cell: (props) => {
-                return <div style={{ textAlign: "right" }}>{USD.format(props.value)}</div>;
-            },
-        },
+        {},
         {
             Header: "Cows Owned",
killedBy: LeaderboardTable tests renders without crashing for empty table with user not logged in
statusReason: Error: A column ID (or string accessor) is required!

[Killed] BlockStatement
main/components/Leaderboard/LeaderboardTable.js:22:30
         {
             Header: "Total Wealth",
             accessor: "totalWealth",
-            Cell: (props) => {
-                return <div style={{ textAlign: "right" }}>{USD.format(props.value)}</div>;
-            },
+            Cell: (props) => {},
         },
         {
killedBy: LeaderboardTable tests Has the expected column headers and content for adminUser
statusReason: Error: Cell(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] ObjectLiteral
main/components/Leaderboard/LeaderboardTable.js:26:9
                 return <div style={{ textAlign: "right" }}>{USD.format(props.value)}</div>;
             },
         },
-        {
-            Header: "Cows Owned",
-            accessor: "numOfCows",
-            Cell: (props) => {
-                return <div style={{ textAlign: "right" }}>{props.value}</div>;
-            },
-        },
+        {},
         {
             Header: "Cow Health",
killedBy: LeaderboardPage tests renders without crashing for users
statusReason: Error: A column ID (or string accessor) is required!

[Killed] BlockStatement
main/components/Leaderboard/LeaderboardTable.js:29:30
         {
             Header: "Cows Owned",
             accessor: "numOfCows",
-            Cell: (props) => {
-                return <div style={{ textAlign: "right" }}>{props.value}</div>;
-            },
+            Cell: (props) => {},
         },
         {
killedBy: LeaderboardTable tests Has the expected column headers and content for adminUser
statusReason: Error: Cell(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] StringLiteral
main/components/Leaderboard/LeaderboardTable.js:34:21
             },
         },
         {
-            Header: "Cow Health",
+            Header: "",
             accessor: "cowHealth",
             Cell: (props) => {
killedBy: LeaderboardTable tests Has the expected column headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element with the text: Cow Health. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      role="table"
    >
      <table

[Killed] BlockStatement
main/components/Leaderboard/LeaderboardTable.js:36:30
         {
             Header: "Cow Health",
             accessor: "cowHealth",
-            Cell: (props) => {
-                return <div style={{ textAlign: "right" }}>{props.value}</div>;
-            },
+            Cell: (props) => {},
         },
         {
killedBy: LeaderboardTable tests Has the expected column headers and content for adminUser
statusReason: Error: Cell(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] StringLiteral
main/components/Leaderboard/LeaderboardTable.js:37:49
             Header: "Cow Health",
             accessor: "cowHealth",
             Cell: (props) => {
-                return <div style={{ textAlign: "right" }}>{props.value}</div>;
+                return <div style={{ textAlign: "" }}>{props.value}</div>;
             },
         },
killedBy: LeaderboardTable tests Total wealth is formatted correctly
statusReason: Error: expect(element).toHaveStyle()

- Expected

- text-align: right;

[Killed] ObjectLiteral
main/components/Leaderboard/LeaderboardTable.js:40:9
                 return <div style={{ textAlign: "right" }}>{props.value}</div>;
             },
         },
-        {
-            Header: "Cows Bought",
-            accessor: "cowsBought",
-            Cell: (props) => {
-                return <div style={{ textAlign: "right" }}>{props.value}</div>;
-            },
-        },
+        {},
         {
             Header: "Cows Sold",
killedBy: LeaderboardTable tests renders without crashing for empty table with user not logged in
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Leaderboard/LeaderboardTable.js:41:21
             },
         },
         {
-            Header: "Cows Bought",
+            Header: "",
             accessor: "cowsBought",
             Cell: (props) => {
killedBy: LeaderboardTable tests Has the expected column headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element with the text: Cows Bought. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      role="table"
    >
      <table

[Killed] StringLiteral
main/components/Leaderboard/LeaderboardTable.js:42:23
         },
         {
             Header: "Cows Bought",
-            accessor: "cowsBought",
+            accessor: "",
             Cell: (props) => {
                 return <div style={{ textAlign: "right" }}>{props.value}</div>;
killedBy: LeaderboardTable tests Has the expected column headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="LeaderboardTable-cell-row-0-col-cowsBought"]

<body>
  <div>
    <div
      role="table"
    >
      <table

[Killed] BlockStatement
main/components/Leaderboard/LeaderboardTable.js:43:30
         {
             Header: "Cows Bought",
             accessor: "cowsBought",
-            Cell: (props) => {
-                return <div style={{ textAlign: "right" }}>{props.value}</div>;
-            },
+            Cell: (props) => {},
         },
         {
killedBy: LeaderboardTable tests Has the expected column headers and content for adminUser
statusReason: Error: Cell(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] ObjectLiteral
main/components/Leaderboard/LeaderboardTable.js:47:9
                 return <div style={{ textAlign: "right" }}>{props.value}</div>;
             },
         },
-        {
-            Header: "Cows Sold",
-            accessor: "cowsSold",
-            Cell: (props) => {
-                return <div style={{ textAlign: "right" }}>{props.value}</div>;
-            },
-        },
+        {},
         {
             Header: "Cow Deaths",
killedBy: LeaderboardTable tests renders without crashing for empty table with user not logged in
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Leaderboard/LeaderboardTable.js:49:23
         },
         {
             Header: "Cows Sold",
-            accessor: "cowsSold",
+            accessor: "",
             Cell: (props) => {
                 return <div style={{ textAlign: "right" }}>{props.value}</div>;
killedBy: LeaderboardTable tests Has the expected column headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="LeaderboardTable-cell-row-0-col-cowsSold"]

<body>
  <div>
    <div
      role="table"
    >
      <table

[Killed] BlockStatement
main/components/Leaderboard/LeaderboardTable.js:50:30
         {
             Header: "Cows Sold",
             accessor: "cowsSold",
-            Cell: (props) => {
-                return <div style={{ textAlign: "right" }}>{props.value}</div>;
-            },
+            Cell: (props) => {},
         },
         {
killedBy: LeaderboardTable tests Has the expected column headers and content for adminUser
statusReason: Error: Cell(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] ObjectLiteral
main/components/Leaderboard/LeaderboardTable.js:51:36
             Header: "Cows Sold",
             accessor: "cowsSold",
             Cell: (props) => {
-                return <div style={{ textAlign: "right" }}>{props.value}</div>;
+                return <div style={{}}>{props.value}</div>;
             },
         },
killedBy: LeaderboardTable tests Total wealth is formatted correctly
statusReason: Error: expect(element).toHaveStyle()

- Expected

- text-align: right;

[Killed] BlockStatement
main/components/Leaderboard/LeaderboardTable.js:57:30
         {
             Header: "Cow Deaths",
             accessor: "cowDeaths",
-            Cell: (props) => {
-                return <div style={{ textAlign: "right" }}>{props.value}</div>;
-            },
+            Cell: (props) => {},
         },
     ];
killedBy: LeaderboardTable tests Has the expected column headers and content for adminUser
statusReason: Error: Cell(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
