[Killed] BlockStatement
src/main/pages/AdminStudentsIndexPage.js:3:50
 import BasicLayout from "main/layouts/BasicLayout/BasicLayout";
 
-export default function AdminStudentsIndexPage() {
-  // Stryker disable all : placeholder for future implementation
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Index page not yet implemented</h1>
-        <p>
-          <a href="/admin/createstudents">Create</a>
-        </p>
-        <p>
-          <a href="/admin/editstudents/1">Edit</a>
-        </p>
-      </div>
-    </BasicLayout>
-  );
-}
+export default function AdminStudentsIndexPage() {}
 
killedBy: AdminStudentsIndexPage tests Renders expected content
statusReason: Error: AdminStudentsIndexPage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
