[Killed] ConditionalExpression
src/main/components/OurTable.js:22:23
 // Stryker restore all
 export default function OurTable({ columns, data, testid = "testid", ...rest }) {
     const [pageIndex, setPageIndex] = React.useState(0);
-    const pageSize = (rest.pageSize || 10);
+    const pageSize = (true);
 
     const {
killedBy: OurTable tests renders a table with 3 rows and tests that pagination isn't visible when there are less rows than rows per page
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] LogicalOperator
src/main/components/OurTable.js:22:23
 // Stryker restore all
 export default function OurTable({ columns, data, testid = "testid", ...rest }) {
     const [pageIndex, setPageIndex] = React.useState(0);
-    const pageSize = (rest.pageSize || 10);
+    const pageSize = (rest.pageSize && 10);
 
     const {
killedBy: AdminAnnouncementsPage tests correct href for announcements button as an admin
statusReason: Error: Unable to find an element by: [data-testid="CommonsTable-cell-row-0-col-commons.id"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
