[Killed] ArithmeticOperator
src/main/components/OurTable.js:62:29
                 ))}
             </thead>
             <tbody {...getTableBodyProps()}>
-                {rows.slice(pageIndex * pageSize, (pageIndex + 1) * pageSize).map(row => {
+                {rows.slice(pageIndex / pageSize, (pageIndex + 1) * pageSize).map(row => {
                     prepareRow(row)
                     return (
killedBy: OurTable tests renders a table with 51 rows and tests moving forward and back one page
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <td data-testid="testid-cell-row-10-col-col1" role="cell">Hello 11</td> instead

[Killed] ConditionalExpression
src/main/components/OurTable.js:81:10
                 })}
             </tbody>
         </Table>
-        {rows.length > pageSize && (<div style={paginationStyle}>
+        {true && (<div style={paginationStyle}>
             <Pagination {...getTableProps()}>
                 <Pagination.Prev
killedBy: OurTable tests pagination isn't visible when there is no data
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: null
Received: <span class="page-link" data-testid="testid-prev-page-button" disabled=""><span aria-hidden="true">‹</span><span class="visually-hidden">Previous</span></span>

[Killed] ConditionalExpression
src/main/components/OurTable.js:94:18
                 >
                     {1}
                 </Pagination.Item>)}
-                {pageIndex > 4 && (<Pagination.Ellipsis data-testid={`${testid}-left-ellipsis`} />)}
+                {false}
                 {pageIndex === 4 && (<Pagination.Item
                     onClick={() => setPageIndex(pageIndex - 3)}
killedBy: OurTable tests renders a table with 51 rows and tests the first and last page buttons
statusReason: Error: Unable to find an element by: [data-testid="testid-left-ellipsis"]

<body>
  <div>
    <div
      role="table"
    >
      <table

[Killed] EqualityOperator
src/main/components/OurTable.js:94:18
                 >
                     {1}
                 </Pagination.Item>)}
-                {pageIndex > 4 && (<Pagination.Ellipsis data-testid={`${testid}-left-ellipsis`} />)}
+                {pageIndex >= 4 && (<Pagination.Ellipsis data-testid={`${testid}-left-ellipsis`} />)}
                 {pageIndex === 4 && (<Pagination.Item
                     onClick={() => setPageIndex(pageIndex - 3)}
killedBy: OurTable tests renders a table with 51 rows and moving forward and back two pages
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: null
Received: <a class="page-link" data-testid="testid-left-ellipsis" href="#" role="button" tabindex="0"><span aria-hidden="true">…</span><span class="visually-hidden">More</span></a>

[Killed] ConditionalExpression
src/main/components/OurTable.js:101:18
                 >
                     {pageIndex - 2}
                 </Pagination.Item>)}
-                {pageIndex > 1 && (<Pagination.Item
+                {true && (<Pagination.Item
                     onClick={() => setPageIndex(pageIndex - 2)}
                     data-testid={`${testid}-back-two-page-button`}
killedBy: OurTable tests renders a table with 51 rows and tests the first page
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: null
Received: <a class="page-link" data-testid="testid-back-two-page-button" href="#" role="button" tabindex="0">-1</a>
