[Killed] ConditionalExpression
src/main/components/OurTable.js:95:18
                     {1}
                 </Pagination.Item>)}
                 {pageIndex > 4 && (<Pagination.Ellipsis data-testid={`${testid}-left-ellipsis`} />)}
-                {pageIndex === 4 && (<Pagination.Item
+                {true && (<Pagination.Item
                     onClick={() => setPageIndex(pageIndex - 3)}
                     data-testid={`${testid}-back-three-page-button`}
killedBy: OurTable tests renders a table with 51 rows and tests the first page
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: null
Received: <a class="page-link" data-testid="testid-back-three-page-button" href="#" role="button" tabindex="0">-2</a>

[Killed] ConditionalExpression
src/main/components/OurTable.js:107:18
                 >
                     {pageIndex - 1}
                 </Pagination.Item>)}
-                {pageIndex > 0 && (<Pagination.Item
+                {true && (<Pagination.Item
                     onClick={() => setPageIndex(pageIndex - 1)}
                     data-testid={`${testid}-back-one-page-button`}
killedBy: OurTable tests renders a table with 51 rows and tests the first page
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: null
Received: <a class="page-link" data-testid="testid-back-one-page-button" href="#" role="button" tabindex="0">0</a>
